// data/models.js

export const MODELS = {
  A: 'ABCDEFGHIJKLMNOPQRSTUVWXYZ',                     // ✔ заглавные латинские буквы
  B: 'ABCDEFGHIJKLMNOPQRSTUVWXYZâÇçĞğİıîÖöŞşÜüéàèûôœñáíú¿¡ºªãõÄäÜßëîìòøæØå', // ✔ расширенный латиница + диакритика (опционально)
  C: ['-', ' '],                                       // ✔ символы разделителей (без пустого: обрабатывается отдельно)
  D: 'АВЕІКМНОРСТХ',                                    // ✔ только те кириллические буквы, похожие на латиницу (для BY)
  9: '0123456789'                                       // ✔ цифры
};
