// data/models.js

// Модель A — заглавные латинские буквы
// Модель B — латинские буквы + диакритика (не используется в масках сейчас, но оставил для расширения)
// Модель C — спец.символы: тире, пробел, пустой символ (пустой символ обработан в maskToRegex)
// Модель 9 — цифры

export const MODELS = {
  A: 'ABCDEFGHIJKLMNOPQRSTUVWXYZ',
  B: 'ABCDEFGHIJKLMNOPQRSTUVWXYZâÇçĞğİıîÖöŞşÜüéàèûôœñáíú¿¡ºªãõÄäÜßëîìòøæØå',
  C: ['-', ' '], // пустой символ обработан в regex как опциональность
  9: '0123456789'
};
